import sys
import random

print("Добро пожаловать в игровой подбор смешных имён и фамилий. Все совпадения случайны...")

print("Вот например такой вариант:\n")

first = ("Аввакум","Агафоник","Агриппин","Акакий","Антилох","Африкан","Баран",
         "Брячислав","Будило","Гад","Гус","Дрюля","Евлампий","Задок","Злобыня",
         "Кал","Капитон","Кикос","Крысан","Мокий","Насрулла","Никодим","Павсикакий",
         "Панос","Перец","Примитив","Пук","Пурдил","Серик","Скот","Факий","Чурка")

last = ("Абыхвост","Аболдуев","Бабай","Бабайда","Бобик","Записайло","Гвиздало","Дрюченко",
        "Беспарточный","Ганган","Жижура","Журавель","Зимогляд","Вареник","Воробейчик",
        "Кляузер","Гадючко","Косяк","Лупинос","Дериглазов","Муховоз","Купибеда","Забийворота",
        "Лошак","Какуля","Пидкуйко","Козодой","Пизюн","Пупикин","Познахирко","Салоед","Собакарь")

while True:
    firstName = random.choice(first)
    lastName = random.choice(last)

    print("\n")
    # print("{} {}".format(firstName,lastName), file=sys.stderr)
    print(f"{firstName} {lastName}", file=sys.stderr)
    print("\n")

    try_again = input("\n\nПопробуете ещё раз? Нажмите Enter если хотите продолжить, или n чтобы выйти...")
    if try_again.lower() == "n":
        break

input("\nНажмите Enter для завершения работы")

